# <span style="color: maroon;"> Credit Card Transaction Analysis - PART 1: Credit  card company POV </span>

### *<span style= "color:gray;"> Thought process, Insights and Recommendations</span>*

### *Context* :  
 __Bank "ABC" had inaugurated offering their credit card facility on 1st Oct, 2013.__  
__They started collecting data on the credit card transaction details since then.__  
    
__Now, after nearly two years, they have a stakeholder meeting on June 1st 2015 to assess the situation regarding the growth in the credit card section.__  

__The data till now (latest data being 26th May 2015) needs to be analysed and <span style="color:green;">insights and recommendations needs to be presented to the stakeholders during their meeting so that they can take data-driven decision on how to proceed.__</span>

### Source of data:  
*Credit_card_transactions_India.csv*

### *<span style= "color:gray;"> STEP 1: Getting to know the data</span>*

<span style="font-size:14px;"> __Let's start with getting the look and feel of the data that we need to work with.__ 
    
__We would be looking at the number of rows and columns of the data along with what each column denotes and the data types.__ 
    
__We would also be noting various obvious issues/ anomalies with the data that needs to be fixed as a part of cleaning the data although data cleaning is not the mail goal of this section.__ </span>

In [37]:
import numpy as np
import pandas as pd

In [38]:
original_df = pd.read_csv(r"D:\Data Analysis\Datasets\Credit_card_transactions_India.csv")

In [39]:
working_df = original_df.copy(deep=True)
working_df

,index,City,Date,Card Type,Exp Type,Gender,Amount
0,0,"Delhi, India",29-Oct-14,Gold,Bills,F,82475
1,1,"Greater Mumbai, India",22-Aug-14,Platinum,Bills,F,32555
2,2,"Bengaluru, India",27-Aug-14,Silver,Bills,F,101738
3,3,"Greater Mumbai, India",12-Apr-14,Signature,Bills,F,123424
4,4,"Bengaluru, India",5-May-15,Gold,Bills,F,171574
...,...,...,...,...,...,...,...
26047,26047,"Kolkata, India",22-Jun-14,Silver,Travel,F,128191
26048,26048,"Pune, India",3-Aug-14,Signature,Travel,M,246316
26049,26049,"Hyderabad, India",16-Jan-15,Silver,Travel,M,265019
26050,26050,"Kanpur, India",14-Sep-14,Silver,Travel,M,88174
26051,26051,"Hyderabad, India",19-Oct-13,Signature,Bills,M,184410


- __There are 6 columns (excluding index) and 26k rows__ 
- __First things first, the index column provided in the file needs to be dropped.__ 
- __The city column has the format: "city name", India.  
    We can drop the comma and India, as it doesn't add any value to the analysis and just retain the actual city name.__ 
- __The dates don't seem to be in chronological order, so the dataframe has to be sorted with dates in ascending order.__


    
### <span style= "color:gray;"> Column_name: Description (expected data type ): </span>

*City: The city in which the transaction took place. (String)* 

*Date: The date of the transaction. (Date)*  

*Card Type: The type of credit card used for the transaction. (String)*  

*Exp Type: The type of expense associated with the transaction. (String)*  

*Gender: The gender of the cardholder. (String)*  

*Amount: The amount of the transaction. (Number)*

__Before we do any further analysis, let's correct the obvious issues__

In [40]:
# Dropping in-built Index column
working_df = working_df.drop('index', axis=1)
working_df

                        City       Date  Card Type Exp Type Gender  Amount
0               Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2           Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4           Bengaluru, India   5-May-15       Gold    Bills      F  171574
...                      ...        ...        ...      ...    ...     ...
26047         Kolkata, India  22-Jun-14     Silver   Travel      F  128191
26048            Pune, India   3-Aug-14  Signature   Travel      M  246316
26049       Hyderabad, India  16-Jan-15     Silver   Travel      M  265019
26050          Kanpur, India  14-Sep-14     Silver   Travel      M   88174
26051       Hyderabad, India  19-Oct-13  Signature    Bills      M  184410

[26052 rows x 6 columns]

In [41]:
#Sorting chronologically
#working_df['Date'] = pd.to_datetime(working_df['Date'])
working_df = working_df.sort_values(by='Date', ascending=True)
working_df

                      City      Date  Card Type       Exp Type Gender  Amount
24582       Chennai, India  1-Apr-14   Platinum  Entertainment      F   93038
16742  Wadgaon Road, India  1-Apr-14       Gold           Food      M  274661
4305      Bengaluru, India  1-Apr-14   Platinum          Bills      F  174903
20368        Jaipur, India  1-Apr-14   Platinum  Entertainment      M  118570
15309         Nokha, India  1-Apr-14  Signature          Bills      M  163677
...                    ...       ...        ...            ...    ...     ...
12607     Bengaluru, India  9-Sep-14       Gold           Food      M  259100
3136          Delhi, India  9-Sep-14   Platinum           Food      F  217217
17742         Udupi, India  9-Sep-14       Gold  Entertainment      M  105855
7435          Delhi, India  9-Sep-14  Signature           Food      M   46182
15194  Rajagangapur, India  9-Sep-14  Signature           Food      M  165047

[26052 rows x 6 columns]

###  <span style="color:red;">The above result shows the importance of making sure the date column has the correct data type </span>  

Let's check the data types of these columns

In [42]:
working_df.dtypes

City         object
Date         object
Card Type    object
Exp Type     object
Gender       object
Amount        int64
dtype: object

 #### <span style="color:purple;">  data type of "Date" column is object. </span>  
 
Let's change it to datetime and see how the new sorting is

In [43]:
# changing date column data type

working_df['Date'] = pd.to_datetime(working_df['Date'])
working_df.dtypes

City                 object
Date         datetime64[ns]
Card Type            object
Exp Type             object
Gender               object
Amount                int64
dtype: object

In [44]:
#Sorting chronologically after changing date column data type

working_df = working_df.sort_values(by='Date', ascending=True)
working_df

,City,Date,Card Type,Exp Type,Gender,Amount
72,"Delhi, India",2013-10-04,Signature,Bills,F,550782
7201,"Greater Mumbai, India",2013-10-04,Gold,Entertainment,M,201942
6931,"Bengaluru, India",2013-10-04,Gold,Fuel,F,236037
8645,"Bengaluru, India",2013-10-04,Silver,Bills,M,159769
23691,"Chennai, India",2013-10-04,Gold,Grocery,M,27511
...,...,...,...,...,...,...
7891,"Ahmedabad, India",2015-05-26,Platinum,Grocery,F,269998
24604,"Jaipur, India",2015-05-26,Silver,Fuel,F,292561
9980,"Delhi, India",2015-05-26,Platinum,Entertainment,F,200932
22648,"Lucknow, India",2015-05-26,Gold,Grocery,M,249011
14658,"Washim, India",2015-05-26,Signature,Fuel,F,223068

 #### <span style="color:purple;">  but now the index is all jumbled, so let's reset it. </span> 
Note that on resetting, the current index would be added as a new column, hence we need to set drop=True for dropping the older, jumbled index

In [45]:
# Resetting index
working_df = working_df.reset_index(drop=True)
working_df

,City,Date,Card Type,Exp Type,Gender,Amount
0,"Delhi, India",2013-10-04,Signature,Bills,F,550782
1,"Greater Mumbai, India",2013-10-04,Gold,Entertainment,M,201942
2,"Bengaluru, India",2013-10-04,Gold,Fuel,F,236037
3,"Bengaluru, India",2013-10-04,Silver,Bills,M,159769
4,"Chennai, India",2013-10-04,Gold,Grocery,M,27511
...,...,...,...,...,...,...
26047,"Ahmedabad, India",2015-05-26,Platinum,Grocery,F,269998
26048,"Jaipur, India",2015-05-26,Silver,Fuel,F,292561
26049,"Delhi, India",2015-05-26,Platinum,Entertainment,F,200932
26050,"Lucknow, India",2015-05-26,Gold,Grocery,M,249011
26051,"Washim, India",2015-05-26,Signature,Fuel,F,223068